Tekla.Structures.ModelInternal.ModelObjectFactory
The Tekla.Structures.ModelInternal.ModelObjectFactory class instantiates empty object instances.

Tekla.Structures.ModelInternal.ModelObjectFactory.GetCorrectInstance(Tekla.Structures.Model.Model,Tekla.Structures.Identifier)
Returns a default Tekla.Structures.Model.ModelObject of correct type for the given id and type without calling Select.
model: The Tekla.Structures.Model to select the instance's type from.
identifier: Identifier of the object
Returns: A Tekla.Structures.Model.ModelObject of correct type

Tekla.Structures.ModelInternal.ModelObjectFactory.GetCorrectInstance(Tekla.Structures.Model.Model,Tekla.Structures.Identifier,Tekla.Structures.Model.ModelObject.ModelObjectEnum,System.Int32)
Returns a default Tekla.Structures.Model.ModelObject of correct type for the given id and type without calling Select.
model: The Tekla.Structures.Model to select the instance's type from.
identifier: Identifier of the object
modelObjectType: Type of the object
modelObjectSubType: The sub-type of the object; the value's interpretation depends on modelObjectType.
Returns: A Tekla.Structures.Model.ModelObject of correct type

Tekla.Structures.ModelInternal.ModelObjectFactory.GetCorrectInstance(Tekla.Structures.Model.Model,Tekla.Structures.Identifier,Tekla.Structures.ModelInternal.dotModelObjectType_t)
Gets a correct Tekla.Structures.Model.ModelObject type instance for the given modelObjectType.
model: The Tekla.Structures.Model.Model to select the instance from; ignored.
identifier: The Tekla.Structures.Identifier to assign to the returned instance.
modelObjectType: The Tekla.Structures.ModelInternal.dotModelObjectType_t describing the type of Tekla.Structures.Model.ModelObject to get.
Returns: A correct Tekla.Structures.Model.ModelObject type instance for the given modelObjectType.